spec/fixtures/vcr_cassettes/lib/stripe_client/charge.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=test%40test.com&source=tok_mastercard
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.2.0
      Authorization:
      - Bearer sk_test_g8WBO50APg0ILlbTMRpcPYiP
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.2.0","lang":"ruby","lang_version":"2.5.3 p105 (2018-10-18)","platform":"x64-mingw32","engine":"ruby","publisher":"stripe","uname":"Microsoft
        Windows [Version 10.0.17134.407]","hostname":"DESKTOP-KKV8MLI"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 30 Nov 2018 05:42:58 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1497'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_9yp3P1y5RiliRP
      Stripe-Version:
      - '2017-06-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_E4DCx7FleBolg2",
          "object": "customer",
          "account_balance": 0,
          "created": 1543556578,
          "currency": null,
          "default_source": "card_1Dc4mEByuh66yo7xSirB6CQ3",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "test@test.com",
          "invoice_prefix": "4B4733A",
          "livemode": false,
          "metadata": {
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1Dc4mEByuh66yo7xSirB6CQ3",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "MasterCard",
                "country": "US",
                "customer": "cus_E4DCx7FleBolg2",
                "cvc_check": null,
                "dynamic_last4": null,
                "exp_month": 11,
                "exp_year": 2019,
                "fingerprint": "kTYOXUtSnlkcQHJd",
                "funding": "credit",
                "last4": "4444",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_E4DCx7FleBolg2/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_E4DCx7FleBolg2/subscriptions"
          },
          "tax_info": null,
          "tax_info_verification": null
        }
    http_version: 
  recorded_at: Fri, 30 Nov 2018 05:42:58 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: customer=cus_E4DCx7FleBolg2&amount=20000&description=Description&currency=usd
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/4.2.0
      Authorization:
      - Bearer sk_test_g8WBO50APg0ILlbTMRpcPYiP
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"4.2.0","lang":"ruby","lang_version":"2.5.3 p105 (2018-10-18)","platform":"x64-mingw32","engine":"ruby","publisher":"stripe","uname":"Microsoft
        Windows [Version 10.0.17134.407]","hostname":"DESKTOP-KKV8MLI"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Fri, 30 Nov 2018 05:42:59 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1852'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_nN9wt25HOBl7an
      Stripe-Version:
      - '2017-06-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_1Dc4mEByuh66yo7xA9QOjtud",
          "object": "charge",
          "amount": 20000,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": "txn_1Dc4mEByuh66yo7xw1ihwT7w",
          "captured": true,
          "created": 1543556578,
          "currency": "usd",
          "customer": "cus_E4DCx7FleBolg2",
          "description": "Description",
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {
          },
          "invoice": null,
          "livemode": false,
          "metadata": {
          },
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "risk_score": 21,
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "payment_intent": null,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_1Dc4mEByuh66yo7xA9QOjtud/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "card_1Dc4mEByuh66yo7xSirB6CQ3",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "MasterCard",
            "country": "US",
            "customer": "cus_E4DCx7FleBolg2",
            "cvc_check": null,
            "dynamic_last4": null,
            "exp_month": 11,
            "exp_year": 2019,
            "fingerprint": "kTYOXUtSnlkcQHJd",
            "funding": "credit",
            "last4": "4444",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Fri, 30 Nov 2018 05:42:59 GMT
recorded_with: VCR 4.0.0
